GopalSaraf/Practicals/PSDL/include/proc/pic18f67j50.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F67J50_INC_
#define _PIC18F67J50_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F67J50
 */

/*
 * Device Registers
 */

// Register: PMSTAT
#define PMSTAT PMSTAT
PMSTAT                                   equ 0F40h

// Register: PMSTATL
#define PMSTATL PMSTATL
PMSTATL                                  equ 0F40h
// bitfield definitions
PMSTATL_OB0E_POSN                        equ 0000h
PMSTATL_OB0E_POSITION                    equ 0000h
PMSTATL_OB0E_SIZE                        equ 0001h
PMSTATL_OB0E_LENGTH                      equ 0001h
PMSTATL_OB0E_MASK                        equ 0001h
PMSTATL_OB1E_POSN                        equ 0001h
PMSTATL_OB1E_POSITION                    equ 0001h
PMSTATL_OB1E_SIZE                        equ 0001h
PMSTATL_OB1E_LENGTH                      equ 0001h
PMSTATL_OB1E_MASK                        equ 0002h
PMSTATL_OB2E_POSN                        equ 0002h
PMSTATL_OB2E_POSITION                    equ 0002h
PMSTATL_OB2E_SIZE                        equ 0001h
PMSTATL_OB2E_LENGTH                      equ 0001h
PMSTATL_OB2E_MASK                        equ 0004h
PMSTATL_OB3E_POSN                        equ 0003h
PMSTATL_OB3E_POSITION                    equ 0003h
PMSTATL_OB3E_SIZE                        equ 0001h
PMSTATL_OB3E_LENGTH                      equ 0001h
PMSTATL_OB3E_MASK                        equ 0008h
PMSTATL_OBUF_POSN                        equ 0006h
PMSTATL_OBUF_POSITION                    equ 0006h
PMSTATL_OBUF_SIZE                        equ 0001h
PMSTATL_OBUF_LENGTH                      equ 0001h
PMSTATL_OBUF_MASK                        equ 0040h
PMSTATL_OBE_POSN                         equ 0007h
PMSTATL_OBE_POSITION                     equ 0007h
PMSTATL_OBE_SIZE                         equ 0001h
PMSTATL_OBE_LENGTH                       equ 0001h
PMSTATL_OBE_MASK                         equ 0080h

// Register: PMSTATH
#define PMSTATH PMSTATH
PMSTATH                                  equ 0F41h
// bitfield definitions
PMSTATH_IB0F_POSN                        equ 0000h
PMSTATH_IB0F_POSITION                    equ 0000h
PMSTATH_IB0F_SIZE                        equ 0001h
PMSTATH_IB0F_LENGTH                      equ 0001h
PMSTATH_IB0F_MASK                        equ 0001h
PMSTATH_IB1F_POSN                        equ 0001h
PMSTATH_IB1F_POSITION                    equ 0001h
PMSTATH_IB1F_SIZE                        equ 0001h
PMSTATH_IB1F_LENGTH                      equ 0001h
PMSTATH_IB1F_MASK                        equ 0002h
PMSTATH_IB2F_POSN                        equ 0002h
PMSTATH_IB2F_POSITION                    equ 0002h
PMSTATH_IB2F_SIZE                        equ 0001h
PMSTATH_IB2F_LENGTH                      equ 0001h
PMSTATH_IB2F_MASK                        equ 0004h
PMSTATH_IB3F_POSN                        equ 0003h
PMSTATH_IB3F_POSITION                    equ 0003h
PMSTATH_IB3F_SIZE                        equ 0001h
PMSTATH_IB3F_LENGTH                      equ 0001h
PMSTATH_IB3F_MASK                        equ 0008h
PMSTATH_IBOV_POSN                        equ 0006h
PMSTATH_IBOV_POSITION                    equ 0006h
PMSTATH_IBOV_SIZE                        equ 0001h
PMSTATH_IBOV_LENGTH                      equ 0001h
PMSTATH_IBOV_MASK                        equ 0040h
PMSTATH_IBF_POSN                         equ 0007h
PMSTATH_IBF_POSITION                     equ 0007h
PMSTATH_IBF_SIZE                         equ 0001h
PMSTATH_IBF_LENGTH                       equ 0001h
PMSTATH_IBF_MASK                         equ 0080h

// Register: PMEN
#define PMEN PMEN
PMEN                                     equ 0F42h

// Register: PMEL
#define PMEL PMEL
PMEL                                     equ 0F42h
// bitfield definitions
PMEL_PTENL_POSN                          equ 0000h
PMEL_PTENL_POSITION                      equ 0000h
PMEL_PTENL_SIZE                          equ 0008h
PMEL_PTENL_LENGTH                        equ 0008h
PMEL_PTENL_MASK                          equ 00FFh
PMEL_PTEN0_POSN                          equ 0000h
PMEL_PTEN0_POSITION                      equ 0000h
PMEL_PTEN0_SIZE                          equ 0001h
PMEL_PTEN0_LENGTH                        equ 0001h
PMEL_PTEN0_MASK                          equ 0001h
PMEL_PTEN1_POSN                          equ 0001h
PMEL_PTEN1_POSITION                      equ 0001h
PMEL_PTEN1_SIZE                          equ 0001h
PMEL_PTEN1_LENGTH                        equ 0001h
PMEL_PTEN1_MASK                          equ 0002h
PMEL_PTEN2_POSN                          equ 0002h
PMEL_PTEN2_POSITION                      equ 0002h
PMEL_PTEN2_SIZE                          equ 0001h
PMEL_PTEN2_LENGTH                        equ 0001h
PMEL_PTEN2_MASK                          equ 0004h
PMEL_PTEN3_POSN                          equ 0003h
PMEL_PTEN3_POSITION                      equ 0003h
PMEL_PTEN3_SIZE                          equ 0001h
PMEL_PTEN3_LENGTH                        equ 0001h
PMEL_PTEN3_MASK                          equ 0008h
PMEL_PTEN4_POSN                          equ 0004h
PMEL_PTEN4_POSITION                      equ 0004h
PMEL_PTEN4_SIZE                          equ 0001h
PMEL_PTEN4_LENGTH                        equ 0001h
PMEL_PTEN4_MASK                          equ 0010h
PMEL_PTEN5_POSN                          equ 0005h
PMEL_PTEN5_POSITION                      equ 0005h
PMEL_PTEN5_SIZE                          equ 0001h
PMEL_PTEN5_LENGTH                        equ 0001h
PMEL_PTEN5_MASK                          equ 0020h
PMEL_PTEN6_POSN                          equ 0006h
PMEL_PTEN6_POSITION                      equ 0006h
PMEL_PTEN6_SIZE                          equ 0001h
PMEL_PTEN6_LENGTH                        equ 0001h
PMEL_PTEN6_MASK                          equ 0040h
PMEL_PTEN7_POSN                          equ 0007h
PMEL_PTEN7_POSITION                      equ 0007h
PMEL_PTEN7_SIZE                          equ 0001h
PMEL_PTEN7_LENGTH                        equ 0001h
PMEL_PTEN7_MASK                          equ 0080h

// Register: PMEH
#define PMEH PMEH
PMEH                                     equ 0F43h
// bitfield definitions
PMEH_PTENH_POSN                          equ 0000h
PMEH_PTENH_POSITION                      equ 0000h
PMEH_PTENH_SIZE                          equ 0008h
PMEH_PTENH_LENGTH                        equ 0008h
PMEH_PTENH_MASK                          equ 00FFh
PMEH_PTEN8_POSN                          equ 0000h
PMEH_PTEN8_POSITION                      equ 0000h
PMEH_PTEN8_SIZE                          equ 0001h
PMEH_PTEN8_LENGTH                        equ 0001h
PMEH_PTEN8_MASK                          equ 0001h
PMEH_PTEN9_POSN                          equ 0001h
PMEH_PTEN9_POSITION                      equ 0001h
PMEH_PTEN9_SIZE                          equ 0001h
PMEH_PTEN9_LENGTH                        equ 0001h
PMEH_PTEN9_MASK                          equ 0002h
PMEH_PTEN10_POSN                         equ 0002h
PMEH_PTEN10_POSITION                     equ 0002h
PMEH_PTEN10_SIZE                         equ 0001h
PMEH_PTEN10_LENGTH                       equ 0001h
PMEH_PTEN10_MASK                         equ 0004h
PMEH_PTEN11_POSN                         equ 0003h
PMEH_PTEN11_POSITION                     equ 0003h
PMEH_PTEN11_SIZE                         equ 0001h
PMEH_PTEN11_LENGTH                       equ 0001h
PMEH_PTEN11_MASK                         equ 0008h
PMEH_PTEN12_POSN                         equ 0004h
PMEH_PTEN12_POSITION                     equ 0004h
PMEH_PTEN12_SIZE                         equ 0001h
PMEH_PTEN12_LENGTH                       equ 0001h
PMEH_PTEN12_MASK                         equ 0010h
PMEH_PTEN13_POSN                         equ 0005h
PMEH_PTEN13_POSITION                     equ 0005h
PMEH_PTEN13_SIZE                         equ 0001h
PMEH_PTEN13_LENGTH                       equ 0001h
PMEH_PTEN13_MASK                         equ 0020h
PMEH_PTEN14_POSN                         equ 0006h
PMEH_PTEN14_POSITION                     equ 0006h
PMEH_PTEN14_SIZE                         equ 0001h
PMEH_PTEN14_LENGTH                       equ 0001h
PMEH_PTEN14_MASK                         equ 0040h
PMEH_PTEN15_POSN                         equ 0007h
PMEH_PTEN15_POSITION                     equ 0007h
PMEH_PTEN15_SIZE                         equ 0001h
PMEH_PTEN15_LENGTH                       equ 0001h
PMEH_PTEN15_MASK                         equ 0080h

// Register: PMDIN2
#define PMDIN2 PMDIN2
PMDIN2                                   equ 0F44h

// Register: PMDIN2L
#define PMDIN2L PMDIN2L
PMDIN2L                                  equ 0F44h

